# визначення значень технологічних параметрів методом стохастичної екстраполяції
M_X = 270
X_TI = 280
D_X = 20
T0 = 8
T = 16
K = 2
P_T = 0.8 * T0


def extrapolation():
    print("Вхідні дані 22 варіант:")
    print(f"Математичне очікування = {M_X} °C")
    print(f"Значення параметру на i-му циклі вимірювання = {X_TI} °C")
    print(f"Дисперсія = {D_X} °C")
    print(f"Тривалість циклу = {T0} c")
    print(f"Час затухання авто-кореляційної функції = {T} c")
    print(f"Параметр = {K}")
    print(f"Період прогнозу = {P_T} c\n")

    # Розраховуємо значення автокореляційнї функції Kx(Зміна температури по часу) за формулою 3.9
    print('Розраховуємо значення автокореляційної функціїЗміна температури по часу): ')
    kx = D_X * (1 - (P_T / T) ** 2)
    print(f'Автокореляційна функція Kx = {kx} °C\n')

    # Для екстраполяції використаємо формулу(3.10)
    extra = kx / D_X * (X_TI - M_X) + M_X
    print(f'Результат екстраполяції Xextr = {extra} °C')


if __name__ == "__main__": extrapolation()
